package ua.khai.slesarev.bookfinder.ui.util.resourse_util

val booksMap = mapOf(
    "Топ продаж" to listOf(
        "Лунный след\nДжонатан Свифт",
        "Последний рассвет\nМарк Твен",
        "Пыль дорог\nДжейн Остин",
        "Тайны замка\nАгата Кристи",
        "Эхо гор\nЭрнест Хемингуэй",
        "Забытые миры\nВиктор Гюго",
        "Пыль дорог\nВиктор Гюго",
        "Тени прошлого\nГенри Джеймс",
        "След в вечности\nТана Фрэнч"
    ),
    "Скидки на книги" to listOf(
        "Лунный след\nДжонатан Свифт",
        "Последний рассвет\nМарк Твен",
        "Пыль дорог\nДжейн Остин",
        "Тайны замка\nАгата Кристи",
        "Эхо гор\nЭрнест Хемингуэй",
        "Забытые миры\nВиктор Гюго",
        "Пыль дорог\nВиктор Гюго",
        "Тени прошлого\nГенри Джеймс",
        "След в вечности\nТана Фрэнч"
    ),
    "Новые книги" to listOf(
        "Лунный след\nДжонатан Свифт",
        "Последний рассвет\nМарк Твен",
        "Пыль дорог\nДжейн Остин",
        "Тайны замка\nАгата Кристи",
        "Эхо гор\nЭрнест Хемингуэй",
        "Забытые миры\nВиктор Гюго",
        "Пыль дорог\nВиктор Гюго",
        "Тени прошлого\nГенри Джеймс",
        "След в вечности\nТана Фрэнч"
    ),
    "Триллеры" to listOf(
        "Лунный след\nДжонатан Свифт",
        "Последний рассвет\nМарк Твен",
        "Пыль дорог\nДжейн Остин",
        "Тайны замка\nАгата Кристи",
        "Эхо гор\nЭрнест Хемингуэй",
        "Забытые миры\nВиктор Гюго",
        "Пыль дорог\nВиктор Гюго",
        "Тени прошлого\nГенри Джеймс",
        "След в вечности\nТана Фрэнч"
    ),
    "Боевики" to listOf(
        "Лунный след\nДжонатан Свифт",
        "Последний рассвет\nМарк Твен",
        "Пыль дорог\nДжейн Остин",
        "Тайны замка\nАгата Кристи",
        "Эхо гор\nЭрнест Хемингуэй",
        "Забытые миры\nВиктор Гюго",
        "Пыль дорог\nВиктор Гюго",
        "Тени прошлого\nГенри Джеймс",
        "След в вечности\nТана Фрэнч"
    ),
    "Приключения" to listOf(
        "Лунный след\nДжонатан Свифт",
        "Последний рассвет\nМарк Твен",
        "Пыль дорог\nДжейн Остин",
        "Тайны замка\nАгата Кристи",
        "Эхо гор\nЭрнест Хемингуэй",
        "Забытые миры\nВиктор Гюго",
        "Пыль дорог\nВиктор Гюго",
        "Тени прошлого\nГенри Джеймс",
        "След в вечности\nТана Фрэнч"
    ),
    "Романтика" to listOf(
        "Лунный след\nДжонатан Свифт",
        "Последний рассвет\nМарк Твен",
        "Пыль дорог\nДжейн Остин",
        "Тайны замка\nАгата Кристи",
        "Эхо гор\nЭрнест Хемингуэй",
        "Забытые миры\nВиктор Гюго",
        "Пыль дорог\nВиктор Гюго",
        "Тени прошлого\nГенри Джеймс",
        "След в вечности\nТана Фрэнч"
    ),
    "Поиск по категориям" to listOf(
        "Лунный след\nДжонатан Свифт",
        "Последний рассвет\nМарк Твен",
        "Пыль дорог\nДжейн Остин",
        "Тайны замка\nАгата Кристи",
        "Эхо гор\nЭрнест Хемингуэй",
        "Забытые миры\nВиктор Гюго",
        "Пыль дорог\nВиктор Гюго",
        "Тени прошлого\nГенри Джеймс",
        "След в вечности\nТана Фрэнч"
    )
)

fun getBookResourses():Map<String, List<String>>{
    return booksMap
}